[
    {
        "id": "adv-tichaona-govere",
        "profileType": "Founding & Managing Partner",
        "name": "Adv Tichaona Govere",
        "position": "Founding & Managing Partner",
        "yearOfRegistration": 2007,
        "qualification": "Bachelor of Laws Honours Degree (LLBS Hons) - University of Zimbabwe",
        "email": "tg@goverelawchambers.co.zw/ tichgovere@gmail.com",
        "status": "Admitted to practise as a Legal Practitioner, Notary Public and Conveyancer in Zimbabwe",
        "areaofPractice": "Contract law, delict law (or law of torts), corporate and commercial law work,  loans and leases, agreements of sale, debt collection, and hiring and hire purchase agreements, mining, notarial work, immovable property and  conveyancing (including property transfers and mortgage and notarial bonds), labour and employment law, matrimonial or family matters, civil law and criminal litigation, mergers, demergers, acquisitions, Zimbabwe Stock Exchange listings, company reconstructions, liquidation, judicial management and scheme of arrangements, major foreign investments, Zimbabwe Investment Authority applications, Tariff and Competition Commission applications, Exchange Control applications, taxation matters, environmental compliance, good corporate governance issues, patents, copyright and trade marks matters, aviation laws, rules and regulations. <br><br>The Founding & Managing Partner, Adv Tichaona Govere, is a holder of a valid Bachelor of Laws Honours Degree, LLB (HONS) obtained from the\tUniversity of Zimbabwe during the period2003-2007. He is duly registered with the High Court of Zimbabwe and the Law Society of Zimbabwe and is accordingly entitled to practice as a Legal Practitioner, Conveyancer and Notary Public. <br><br>Upon completion of his studies, he joined the Ministry of Justice, Legal and Parliamentary Affairs in Zimbabwe from November2007 to February2008 as a\tLegal Officer/Prosecutor based at Harare Magistrates Court (Criminal). In March2008, he joined the private practice with one of the leading\tand colossal law firms in Zimbabwe, Messrs Coghlan, Welsh & Guest (Incorporating Stumbles & Rowe) at Harare. Having practiced with the said law firm and gained invaluable experience for over three years, he left Messrs Coghlan, Welsh & Guest Legal\tPractitioners in March2011 to found and manage Govere Law Chambers Attorneys to date. Apart from providing professional legal solutions to legal puzzles, Tichaona Govere fervently ministers in the everlasting Kingdom of the Most High God. He is an indefatigable Advocate of the the sound\tand unadulterated glad tidings of the Messiah-Jesus Christ of Nazareth.",
        "imgUrl": "img/profiles/tichaona-govere.jpeg"
    },
    {
        "id": "Sandra-Mbetu-Mangwiza",
        "profileType": "Associate Partner",
        "name": "Sandra Mbetu Mangwiza",
        "position": "Associate Partner",
        "yearOfRegistration": 2014,
        "qualification": "LLBS (HONS) - Bachelor of Laws Honours Degree from the Univerisity of Zimbabwe",
        "email": "smm@goverelawchambers.co.zw / smbetumangwiza@gmail.com",
        "status": "Admitted to practice as a Legal Practitioner, Notary Public and Conveyancer in Zimbabwe",
        "areaofPractice": "Mrs Sandra Mbetu Mangwiza is a practical, efficient and result oriented individual who enjoys providing effective solutions to legal problems. She is a holder of a valid Bachelor of Laws Honours Degree from the Univerisity of Zimbabwe. She is duly registered with the High Court of Zimbabwe and the Law Society of Zimbabwe and is entitled to practice as a legal practitioner and Conveyancer. Since joining GLC in 2014, she has been involved in debt recoveries and fore closure. She has been involved in civil and criminal \tlitigation, deceased estates, labur and employment law, lease and sale agreements, conveyancing and corporate work. She is currently studying towards a Masters in Business Administration with the University of Gloucestershire.",
        "imgUrl": "img/profiles/sandra-mbetu-mangwiza.jpeg"
    }
]