[
    {
        "name": "Corporate Law & Commercial Law",
        "description": "Coghlan Welsh & Guest provides Mergers and Acquisitions, corporate, commercial, regulatory, compliance, commercial drafting litigation and intellectual property support to a wide ranging client base. The firm has legal Practitioners who in addition to legal training also have further training and qualifications in business, commercial and corporate law. The commercial and corporate law teams offer effective, appropriate and efficient advise backed by a well stocked and up to date library; and research resource. Our team members are part of the International Bar Association and regularly attend global conferences and seminars in order to keep up to date with trends affecting the region and the global capital markets."
    },
    {
        "name": "Financial Institutions",
        "description": "Coghlan Welsh & Guest has a prominent financial institutions practice with a thorough understanding of the banking and finance, commercial and regulatory environment, locally, regionally and internationally. Disciplines include acquisition finance, asset finance, cross-border finance, debt capital markets, export credit finance and project finance. The practice advises on the full spectrum of corporate and commercial work including commercial, regulatory and dispute resolution requirements of the banking industry, long term and short-term insurers, reinsurers and their intermediaries."
    },
    {
        "name": "Conveyancing",
        "description": "The firm has a team of four legal practitioners who specialize in conveyancing and property law. These lawyers are dedicated to this area of the law and each legal practitioner has a team of at least 4 paralegals and personal assistants who are dedicated to conveyancing work. Our firm is well placed to attend to conveyancing work i.e. transfers, registration and cancellation of mortgage bonds and other securities, sectional title, subdivisions and consolidations. We have been involved in many development schemes including staff loan schemes for big corporations, banks and similar organizations. The conveyancing fees are regulated by the Tariff set by the Law Society of Zimbabwe."
    },
    {
        "name": "Debt Recovery",
        "description": "The Practice has a vibrant debt recovery department which extends to litigation in both the High Court and the Magistrates Courts. The firm has a good working relationship with tracing agents in order to guarantee maximum returns for our clients. The practice also drafts, reviews and advises on loan agreements and securities for debts. The department has many years of collective experience advising on debtor claims and enforcing commercial, financing and leasing agreements."
    },
    {
        "name": "Intellectual Property",
        "description": "Coghlan Welsh & Guest offers service in intellectual property registration (locally, regionally and internationally), advisory, assignment and cession of intellectual property, management and maintenance of intellectual property portfolios on behalf of clients. The Practice deals in all intellectual law aspects namely patents, trademarks, copyright, industrial designs and geographical indications. The practice has established relations with local, regional and international Intellectual Property law practitioners. We also have functional relations with WIPO, ARIPO and ZIPO and our teams regularly attend seminars and workshops with these organizations. Our intellectual Property Law team is well equipped with many years of collective experience."
    },
    {
        "name": "Landlord & Tenant Law",
        "description": "The Practice offers services in landlord and tenant law, including, drafting and review of lease agreements, cessions and assignment of leases, litigation in landlord and tenant disputes, evictions, and representations in alternative dispute resolution. The firm has collective experience of several years in drafting and reviewing lease agreements and also advising pension funds, and large property companies both international and domestic in respect of their property related issues."
    },
    {
        "name": "Labour & Employment Law",
        "description": "The Practice assists companies with all their employment law related matters including contracts of employment drafting and reviews, employment relationship, industrial relations, disciplinary procedures, human resources policy formulation and advise, collective action negotiations and bargaining, termination proceedings, retrenchment and dispute resolution and employee share incentive schemes. Our team has many years of experience in labour litigation and alternative dispute resolution, drafting of codes of conduct, and advising clients on compliance issues including establishing policy guidelines, client training and education. The team draws on a wide base of skills and expertise at all levels of experience and seniority to provide technically correct legal advice that makes business sense."
    },
    {
        "name": "Natural Resources Law",
        "description": "Coghlan Welsh & Guest has an outstanding energy, mining and commodities practice, representing lenders, developers and sponsors in significant projects in Zimbabwe. The Practice has been involved in oil, gas and power projects in the country, and has represented many local regional and international oil companies in drafting; review of agreements and contracts and due diligence reports. The firm has been involved in the mining sector for several years, advising on mining rights and laws, buying, selling, financing and developing projects in the most important mining jurisdictions. The team advises on all matters pertaining to mining and minerals resource, oil and gas, including corporate and transactional, finance, environmental, tax, regulatory, health and safety and litigation and dispute resolution."
    },
    {
        "name": "Technology",
        "description": "The Practice has several years of collective experience in the telecoms and technology industries, offering clients end-to-end solutions including commercial, litigation, regulatory and competition skills all within the telecoms, media and technology industries. Its diverse client base includes technology companies, telecommunications operators, media houses, financial institutions, mining houses and ecommerce businesses."
    },
    {
        "name": "Estates & Planning Department",
        "description": "Coghlan, Welsh & Guest operates the Harare Board of Executors which provides advisory services in estate planning related matters including wills, trusts, donations, registration and administration of estates and executor services."
    },
    {
        "name": "Bankruptcy, Insolvency & Restructuring",
        "description": "Coghlan, Welsh & Guest’s insolvency practice covers all aspects of liquidations, estate sequestrations and surrender, judicial managements and schemes of arrangements and offers of compromise. The firm has been involved and advised in the liquidations and judicial managements of numerous entities in Zimbabwe including banking institutions and companies both listed and private."
    }
    ,
    {
        "name": "Others",
        "description": ""
    }
]