[
  {
    "id": "conveyancing",
    "name": "Conveyancing",
    "description": "GLC has legal practitioners who are admorably experienced in conveyancing and property law. These lawyers are affectionately devoted to providing the services required, including but not limited to, drafting the agreements of sale, drafting power of attorney to make transfer, declaration by Sellers and declaration by the Purchasers, arranging interviews at the Zimbabwe Revnue Authority (ZIMRA), assessment of capital gains tax payable, applications for exemption from paying the capital gains tax, assessment of stamp duty and application for exemptions from paying the same; uplifitng capital gains tax clearance certificate, applications for assessment of rates arrears and rates advance from the city or rural district council or municipalities, uplifting the rates clearance certificate; liasing with the Surveyor General Department; arranging for consent to cancellation or mortgage bonds, drafting the deed of transfer; drafting the lodging cover, lodging the documents with the Registrar of Deeds; uplifting the documents from Registrar of Deeds. GLC also consists of paralegals and personal assistants who are dedicated to conveyancing work. GLC has experts reposed with thorough knowledge and expertise to attend to subdivisions and consolidations of immovable properties, permit to subdivide, title deed endorsements, registration of change of name(s), caveats,\tencumbrances, undivided shares coupled with exclusive right of occupation, partition or rectification transfer, certificates of title, cancellations,\tcessions, releases, waivers and other consents of mortgagees, lesees and creditors."
  },
  {
    "id": "DEBT RECOVERY / COLLECTION",
    "name": "Debt Recovery",
    "description": "GLC has an effective and proficient department which extends to litigation in both the Magistrates Court and High Court as well as appeals and/or reviews in the Supreme Court (Appellate Court) and the Constitutional Court, if need be. GLC has established amicable and amiable professional relationship with tracing agents in order to ensure sustainable amortization of debts. GLC also drafts, reviews and advises on loan agreements and securities for debts. The department has a plethora of years of collective experience advising on debtor claims and enforcing commercial, financing and leasing agreements. The process is usually ignited by issuing and serving the recalcitrant debtors to pay the debt within a certain period failing which court litigation is invoked swiftly and speedily."
  },
  {
    "id": "labour-and-employment-law",
    "name": "Labour & Employment Law",
    "description": "GLC is fully equipped with attorneys reposed with the intimate knowledge and experience to advise employers and employees on matters relating to the contract of employment, formation and operation, rights and obligations of employees and employers; termination of employment; remedies for unlawful termination freedom of association and the inalienable right to organize, collective bargaining as well as dispute settlement under mediation, conciliation and arbitration. A plethora of services are offered in adjudication in the Labour Court and the Superior Court like the High Court, Suprememe Court and the  constititional Court. GLC assists companies with all their employment law related matters including contracts of employment drafting and reviews, employment relationship, industrial relations, disciplinary procedures, human resources policy formulation and advise in peremptory retrenchment procedures and dispute resolution and employee share incentive schemes. GLC team has many years of experience in labour litigation and alternative dispute resolution, drafting of codes of conduct."
  },
  {
    "id": "administrative-law",
    "name": "Administrative Law",
    "description": "Administrative law – administrative decisions and acts – powers granted under statute to administrative authority – ensuring compliance with requirements of Constitution and Administrative Justice Act; reviews and appeals, exhaustion of domestic remidies principles."
  },
  {
    "id": "constitutional-law",
    "name": "Constitutional Law",
    "description": "Constitutional law – Constitution of Zimbabwe– Declaration of Rights and Protection– action to enforce rights – locus standi to bring action said to be in public interest, what must be shown by person bringing action on such grounds, doctrine of ripeness, compliance with rules of the Constitutional Court, drafting pleadings and litigation in the Constitutional Court."
  },
  {
    "id": "corporate-law-and-commercial-law",
    "name": "Corporate Law & Commercial Law",
    "description": "The law of agency and liability of principal, actual and ostensible authority (presumption of authority) rights and responsibilities of majority and minority shareholders, derivative action, corporate, commercial, regulatory, compliance, commercial drafting, litigation and intellectual property support to GLC has attorneys who in addition to legal training also have further training and qualifications in business, commercial and corporate law. The commercial and corporate law teams offer excellent, effective, appropriate and efficient advise backed by a very good library. Our team members regularly attend multifaceted seminars and conferences and in order to keep pace with the ever evolving local, regional and global marketplace. "
  },
  {
    "id": "financial-institutions",
    "name": "Financial Institutions",
    "description": "The GLC attorneys are reposed with perfect and deep understanding of the banking and finance, commercial and regulatory environment, locally, regionally and internationally. Disciplines include but are not limited to: acquisition, finance, asset finance foreign direct investment, debt capital markets, export credit finance and project finance. GLC advises on the full spectrum of corporate and commercial work including commercial, regulatory and dispute resolution requirements of the banking industry, long term and short-term insurers, reinsurers and their intermediaries and civil litigation. "
  },
  {
    "id": "intellectual-property",
    "name": "Intellectual Property",
    "description": "GLC offers service in intellectual property registration (locally, regionally and all the four corners of the earth), advisory, assignment and cession of intellectual property, management and maintenance of intellectual property portfolios on behalf of clients. The Practice deals in all manner of intellectual law aspects namely patents, trademarks, copyright, intangible assets, goodwill protection, industrial designs and geographical indications. The practice has amicable and amiable relations with local, regional and international Intellectual Property law practitioners. Our intellectual Property Law team is well equipped with many years of admirable expertise and experience to deal with the metamorphosing trends locally, regionally and globally."
  },
  {
    "id": "landlord-and-tenant-law",
    "name": "Landlord & Tenant Law",
    "description": "GLC offers services in landlord and tenant law, including, drafting and review of lease agreements, cessions and assignment of leases, litigation in landlord and tenant disputes, property attachments in lieu of rent and  evictions, and representations in alternative dispute resolution like mediation, concilliation and arbitration. The firm has admirable experience of several years in drafting and reviewing lease agreements and also advising and representing humongous pension funds, and colossal property companies both domestic and global in respect of their property related issues. Representation is also offered at the Rent Board dealing with both residential and commercial properties. "
  },
  {
    "id": "natural-resources-law",
    "name": "Natural Resources Law",
    "description": "GLC has a dedicated and devoted team dealing with mining and commodities practice, representing lenders, developers and sponsors in significant projects in Zimbabwe. GLC has been involved in oil, gas and power projects in the country, and has represented many local regional and international oil companies in drafting; review of agreements and contracts and due diligence reports. The firm has been involved in the mining sector for a plethora of years, advising on mining rights and laws, buying, selling, financing and developing projects in the most important mining jurisdictions. GLC advises on all manner of matters pertaining to mining and minerals resource, oil and gas, including corporate and transactional, finance, environmental, tax, regulatory, health and safety and litigation and dispute resolution."
  },
  {
    "id": "technology",
    "name": "Technology",
    "description": "GLC has several years of adorable experience in the telecoms and technology industries, providing top-notch solutions including commercial, litigation, regulatory and competition skills all within the telecoms, media and technology industries. Its avalanche of clients includes but is not limited to technology companies,  telecommunications operators, media houses, financial institutions, mining houses and ecommerce businesses, protection of goodwill and other intangible assets."
  },
  {
    "id": "estates-and-planning-department",
    "name": "Estates & Planning Department",
    "description": "GLC provides advisory services in estate planning related matters including wills, trusts, donations, registration and administration of estates and executor services,liaisons with the Master of the High Court, deceased estate property transfers and all litigation arising from the same. "
  },
  {
    "id": "bankruptcy-insolvency-and-restructuring",
    "name": "Bankruptcy, Insolvency & Restructuring",
    "description": "GLC teams handles restructuring of all manner of companies and provides services including but not limited to scheme of arrangement, liquidation, judicial management and winding up of companies and all manner of litigation inextricably connected with the said processes. GLC handles estate sequestrations and surrender, compromise and novation agreements. The firm has been involved and advised in the liquidations, scheme of arrangment and judicial managements of small to medium and humongous entities in Zimbabwe including banking institutions and companies. "
  },
  {
    "id": "immigration",
    "name": "Immigration",
    "description": "GLC assists in representing immigrants, criminal litigation, documentation."
  },
  {
    "id": "land-acquisition",
    "name": "LAND Acquisition",
    "description": "GLC assists former and new owners permits to occupy the land, and advises on rights and responsibilties of former and new owners. "
  }
]